app/Models/m_ludique.php

    function genereAlea(){
        $db=db_connect();
        $numQuestionsAleatoires = $db->table('questions')
            ->select("questions.id")
            ->where('questions.theme = "Bd"')
            ->orderBy("RAND()")
            ->limit(8)  // 8 questions aléatoires
            ->get()
            ->getResultArray();
---
SELECT `questions`.`id`
FROM `questions`
WHERE `questions`.`theme` = "Bd"
ORDER BY RAND()
 LIMIT 8

    function recupQuestionsReponses(){
        $result = false;
        $db=db_connect();
        $listeNumero = $this->genereAlea();

        // Ensuite, récupérer les réponses correspondantes aux questions sélectionnées
        $query = $db->table('questions')
            ->select("questions.id as id, questions.libelle as question, propositions.libelle as reponse, est_correcte")
            ->join('associer', 'associer.question_id = questions.id')
            ->join('propositions', 'propositions.numero = associer.proposition_id')
            ->whereIn('questions.id', $listeNumero)
            ->where('questions.theme = "Bd"')
            ->orderBy("questions.libelle")
            ->get();
---
SELECT `questions`.`id` as `id`, `questions`.`libelle` as `question`, `propositions`.`libelle` as `reponse`, `est_correcte`
FROM `questions`
JOIN `associer` ON `associer`.`question_id` = `questions`.`id`
JOIN `propositions` ON `propositions`.`numero` = `associer`.`proposition_id`
WHERE `questions`.`id` IN ('71','32','10','40','39','16','30','5')
AND `questions`.`theme` = "Bd"
ORDER BY `questions`.`libelle`

    function recupQuestionsBonneReponse(){
        $result = false;
        $db=db_connect();
        // Récupérer la liste des questions depuis la session
        $listeNumero = session()->get('listeNumero');
        $query = $db->table('questions')
            ->select("questions.id as id, questions.libelle as question, propositions.libelle as reponse,est_correcte")
            ->join('associer','associer.question_id = questions.id')
            ->join('propositions', 'propositions.numero = associer.proposition_id')
            ->where('associer.est_correcte = true')
            ->whereIn ( 'questions.id' ,$listeNumero)
            ->orderBy("questions.libelle")
            ->get();
---
SELECT `questions`.`id` as `id`, `questions`.`libelle` as `question`, `propositions`.`libelle` as `reponse`, `est_correcte`
FROM `questions`
JOIN `associer` ON `associer`.`question_id` = `questions`.`id`
JOIN `propositions` ON `propositions`.`numero` = `associer`.`proposition_id`
WHERE `associer`.`est_correcte` = true
AND `questions`.`id` IN ('5','36','43','75','3','46','13','20')
ORDER BY `questions`.`libelle`